{
    "id": "74eb1cd1-e54b-47b8-bf22-cbc94a12ecf9",
    "number": 19,
    "taskId": 12473,
    "comment": "PRO100 ЕГЭ 29.12.23",
    "text": "<p>Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча снежков. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в кучу <strong>один </strong>снежок или увеличить количество снежков в куче <strong>в два раза</strong>. Для того чтобы лепить снежки, у каждого игрока есть неограниченное количество снега.</p>\n<p>Игра завершается в тот момент, когда количество снежков в куче становится не менее 129. <u><strong>Проигравшим</strong></u><strong> </strong>считается игрок, сделавший последний ход, т.е. первым получивший кучу из 129 или более снежков.</p>\n<p>В начальный момент в куче было S снежков, 1 ≤ S ≤ 128.</p>\n<p>Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.</p>\n<p>Укажите <strong>минимальное </strong>значение S, при котором при любой игре Пети Ваня может выиграть, сделав не более одного хода.</p>",
    "key": "126",
    "hide": false,
    "video": "YjHKqD4d6Bc",
    "timecode": "9272",
    "solve_text": "",
    "user_id": "vk_454421946",
    "files": [],
    "subTask": [
        {
            "key": "63 125",
            "text": "<p style=\"text-align: left;\">Для игры, описанной в задании 19, найдите <strong>два наименьших</strong> значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:</p>\n<p style=\"text-align: left;\">&nbsp; &nbsp; &ndash; Петя не может выиграть, сделав один ход;<br>&nbsp; &nbsp; &ndash; Петя может выиграть, сделав не более двух ходов независимо от того, как будет ходить Ваня.</p>\n<p style=\"text-align: left;\">Найденные значения запишите в ответе в порядке возрастания.</p>",
            "table": {
                "cols": 2,
                "rows": 1
            },
            "number": 20
        },
        {
            "key": "1",
            "text": "<p style=\"text-align: left;\">Для игры, описанной в задании 19, найдите количество значений S, при которых одновременно выполняются два условия:</p>\n<p style=\"text-align: left;\">&nbsp; &nbsp; &ndash; у Вани есть выигрышная стратегия, позволяющая ему выиграть, сделав не более двух ходов при любой игре Пети;<br>&nbsp; &nbsp; &ndash; у Вани нет стратегии, которая позволит ему гарантированно выиграть, сделав не более одного хода.</p>",
            "table": {},
            "number": 21
        }
    ],
    "table": {},
    "difficulty": 1,
    "createdAt": "2023-12-23T08:11:47.124Z",
    "updatedAt": "2024-01-10T12:09:44.901Z"
}